Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/atdf/ATSAME70J19.atdf
        <register caption="Write Protection Mode Register" name="RTC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="RTC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="RTC_CR__TIMEVSEL">
        <value caption="Minute change" name="MINUTE" value="0x0"/>
        <value caption="Hour change" name="HOUR" value="0x1"/>
        <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
        <value caption="Every day at noon" name="NOON" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
      <value-group caption="" name="RTC_MR__OUT0">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__OUT1">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__THIGH">
        <value caption="31.2 ms" name="H_31MS" value="0x0"/>
        <value caption="15.6 ms" name="H_16MS" value="0x1"/>
        <value caption="3.91 ms" name="H_4MS" value="0x2"/>
        <value caption="976 us" name="H_976US" value="0x3"/>
        <value caption="488 us" name="H_488US" value="0x4"/>
        <value caption="122 us" name="H_122US" value="0x5"/>
        <value caption="30.5 us" name="H_30US" value="0x6"/>
        <value caption="15.2 us" name="H_15US" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__TPERIOD">
        <value caption="1 second" name="P_1S" value="0x0"/>
        <value caption="500 ms" name="P_500MS" value="0x1"/>
        <value caption="250 ms" name="P_250MS" value="0x2"/>
        <value caption="125 ms" name="P_125MS" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x525443"/>
      </value-group>
    </module>
    <module name="RTT" caption="Real-time Timer" id="6081" version="M">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status (cleared on read)" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Prescaler Roll-over Status (cleared on read)" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
